# Pandas
- pd.DataFrame()
- pd.pivot_table()

In [1]:
import pandas as pd 
# pd.DataFrame()

## Create DataFrame

In [2]:
# create Dataframe from scratch
raw_data = {
    "name": ["Toy", "Joe", "Mary","John", "Anna"], # frist columns name 
    "age" : [ 33, 25, 20, 22, 31] , # columns age
    "gender": ["M","M","F","M","F"] # columns gender
}

# เปลี่ยน raw_data ที่เป็น dictionary ให้เป็น datafrmae
pd.DataFrame(raw_data)

# ต้องประกาศตัวแปรเพื่อเก็บข้อมูลไว้ใช้ต่อ
# โดยหนด Object df 
df = pd.DataFrame(raw_data)

In [3]:
df

,name,age,gender
0,Toy,33,M
1,Joe,25,M
2,Mary,20,F
3,John,22,M
4,Anna,31,F

## Add a new columns

In [4]:
# ใช้ [] เพื่อสร้าง columns ใหม่ได้เลย 
# df["city"] = "London", # สำหรับทุกคนที่มาจากเมืองเดียวกัน
df["city"] = ['London','London','London','Manchester', 'Liverpool'] # ถ้าต่างคนต่างเมืองกัน ใช้ list ช่วย
df

,name,age,gender,city
0,Toy,33,M,London
1,Joe,25,M,London
2,Mary,20,F,London
3,John,22,M,Manchester
4,Anna,31,F,Liverpool

In [5]:
# shape จะเป็น attribute
df.shape

(5, 4)

## Drop Columns

In [6]:
df = df.drop('city', axis=1)

In [7]:
df

,name,age,gender
0,Toy,33,M
1,Joe,25,M
2,Mary,20,F
3,John,22,M
4,Anna,31,F

In [8]:
# remove row  index=2 or Mary
df = df.drop(axis=0 ,index=2)

In [9]:
df

,name,age,gender
0,Toy,33,M
1,Joe,25,M
3,John,22,M
4,Anna,31,F

In [10]:
# reset_index
df = df.reset_index(drop = True)

In [11]:
df

,name,age,gender
0,Toy,33,M
1,Joe,25,M
2,John,22,M
3,Anna,31,F

## Rename columns

In [12]:
# columns name 
print(df.columns)   # เป็นการเรียกดู attribute ใน dataframe ก็คือชื่อ columns
print(list(df.columns))

Index(['name', 'age', 'gender'], dtype='object')
['name', 'age', 'gender']

In [13]:
# rename columns
df.columns = ['nickname', 'age', 'sex']
df

,nickname,age,sex
0,Toy,33,M
1,Joe,25,M
2,John,22,M
3,Anna,31,F

## Series vs DataFrame

In [14]:
# ดึง columns
df["nickname"]

In [15]:
print(type(df["nickname"]))
print(type(df))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [16]:
# Create a new Series // # index ปกติคือชื่อคอลัมน์ เเต่ในนี้คือชื่อของ Series ในเเต่ละ value ของเเต่ละ structure
s1 = pd.Series(['Mary', 20, 'F'], index= ['nickname', 'age', 'sex'])
print(s1)
print(type(s1))

nickname    Mary
age           20
sex            F
dtype: object
<class 'pandas.core.series.Series'>

In [17]:
# append -> Series เข้าในอยู่ใน DataFrame หลัก 
# append = เอาไปเรียงต่อกัน
df = df.append(s1, ignore_index = True) # ต้องมี ignore_index = True ไม่งั้น Error
df
# TypeError: Can only append a Series if ignore_index=True or if the Series has a name ถ้าไม่มี ignore

,nickname,age,sex
0,Toy,33,M
1,Joe,25,M
2,John,22,M
3,Anna,31,F
4,Mary,20,F

In [18]:
s2 = pd.Series(['London', 'London', 'London', 'Manchester', 'Liverpool'])
df['city'] = s2
df

,nickname,age,sex,city
0,Toy,33,M,London
1,Joe,25,M,London
2,John,22,M,London
3,Anna,31,F,Manchester
4,Mary,20,F,Liverpool

## Write CSV file

In [19]:
df.to_csv('mydata.csv')

## Upload data to datalore

In [20]:
# import csv file
df2 = pd.read_csv('Data/data.csv')
df2

,id,name,city
0,1,John,London
1,2,Joe,Liverpool
2,3,Mary,Manchester
3,4,Anna,Swansea
4,5,David,London

In [22]:
# import excel file
# packges openpyxl
df3 = pd.read_excel('Data/data.xlsx')
df3

,id,name,city
0,1,John,London
1,2,Joe,Liverpool
2,3,Mary,Manchester
3,4,Anna,Swansea
4,5,David,London

In [26]:
# import JSON
df4 = pd.read_json('Data/data.json')
df4

,ebook,language,amazonRating,myFavorite
0,Getting started with Python,python,4.89,True
1,Introduction to R,r,4.88,False
2,SQL for Beginners,sql,4.75,True

In [27]:
df4['myFavorite'].dtype

dtype('bool')